sahoo00/nRF52/TRG2_receiver/Application/client.c
/*
 * client.c
 *
 *  Created on: Mar 11, 2018
 *      Author: Debashis Sahoo
 */


#include "nordic_common.h"
#include "app_uart.h"
#include "app_timer.h"
#include "app_gpiote.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"
#include "ble_nus_c.h"
#include "ble_hci.h"
#include "math.h"

#include "nrf_delay.h"
#include "nrf_nvic.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "common.h"

#define NUS_SERVICE_UUID_TYPE   BLE_UUID_TYPE_VENDOR_BEGIN              /**< UUID type for the Nordic UART Service (vendor specific). */

#define SCAN_INTERVAL           0x0030                                  /**< Determines scan interval in units of 0.625 millisecond. */
#define SCAN_WINDOW             0x0030                                  /**< Determines scan window in units of 0.625 millisecond. */
#define SCAN_TIMEOUT            0x0000                                  /**< Timout when scanning. 0x0000 disables timeout. */

#define MIN_CONNECTION_INTERVAL MSEC_TO_UNITS(20, UNIT_1_25_MS)         /**< Determines minimum connection interval in millisecond. */
#define MAX_CONNECTION_INTERVAL MSEC_TO_UNITS(75, UNIT_1_25_MS)         /**< Determines maximum connection interval in millisecond. */
#define SLAVE_LATENCY           0                                       /**< Determines slave latency in counts of connection events. */
#define SUPERVISION_TIMEOUT     MSEC_TO_UNITS(4000, UNIT_10_MS)         /**< Determines supervision time-out in units of 10 millisecond. */

#define UUID16_SIZE             2                                       /**< Size of 16 bit UUID */
#define UUID32_SIZE             4                                       /**< Size of 32 bit UUID */
#define UUID128_SIZE            16                                      /**< Size of 128 bit UUID */

#define ECHOBACK_BLE_UART_DATA  1                                       /**< Echo the UART data that is received over the Nordic UART Service back to the sender. */

uint8_t button_state = 0;

APP_TIMER_DEF(m_led_timer_id);
APP_TIMER_DEF(m_trg_timer_id);

BLE_NUS_C_DEF(m_ble_smph_c);                                             /**< BLE NUS service client instance. */
BLE_NUS_C_DEF(m_ble_mn_c);                                             /**< BLE NUS service client instance. */
BLE_DB_DISCOVERY_DEF(m_db_disc);                                        /**< DB discovery module instance. */

static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */

static uint32_t trg2c_index = 0;
static uint8_t ready_to_send = 0;
static uint32_t trg2c_event_start = 0;

static uint8_t device_id[17] = {0x00, TRG2_DEVICE_ID};

/**@brief Connection parameters requested for connection. */
static ble_gap_conn_params_t const m_connection_param =
{
    (uint16_t)MIN_CONNECTION_INTERVAL,  // Minimum connection
    (uint16_t)MAX_CONNECTION_INTERVAL,  // Maximum connection
    (uint16_t)SLAVE_LATENCY,            // Slave latency
    (uint16_t)SUPERVISION_TIMEOUT       // Supervision time-out
};

/** @brief Parameters used when scanning. */
static ble_gap_scan_params_t const m_scan_params =
{
    .active   = 1,
    .interval = SCAN_INTERVAL,
    .window   = SCAN_WINDOW,
    .timeout  = SCAN_TIMEOUT,
    #if (NRF_SD_BLE_API_VERSION <= 2)
        .selective   = 0,
        .p_whitelist = NULL,
    #endif
    #if (NRF_SD_BLE_API_VERSION >= 3)
        .use_whitelist = 0,
    #endif
};

/**@brief NUS uuid. */
static ble_uuid_t const m_nus_uuid =
{
    .uuid = BLE_UUID_TRG2C1_SERVICE,
    .type = NUS_SERVICE_UUID_TYPE
};

static ble_uuid128_t const m_smph_uuid = {SMPH_UUID_BASE};
static ble_uuid128_t const m_mn_uuid = {MN_UUID_BASE};
static uint8_t m_smph_addr[BLE_GAP_ADDR_LEN];
static uint8_t m_mn_addr[BLE_GAP_ADDR_LEN];

int8_t array[64];
uint16_t indexArray = 0;
uint16_t countArray = 0;
uint16_t totalArray = 50;
uint16_t window = 5;
uint8_t trg2c_trigger = 0;

uint8_t get_smph_hop() { return m_smph_addr[0]; }
uint8_t get_mn_hop() { return m_mn_addr[0]; }

static uint16_t getValue(int8_t rssi) {
    array[indexArray] = rssi;
    indexArray ++;
    countArray ++;
    if (indexArray > totalArray) { indexArray = 0; }
    if (countArray > totalArray) { countArray = totalArray; }
    uint16_t sum = 0;
    int16_t j = indexArray - 1;
    for (uint16_t i =0; i < countArray && i < window; i++) {
    	if ( j < 0) {
    		j = countArray - 1;
    	}
    	sum = sum + (150 + array[j]);
    	j -- ;
    }
    return sum;
}

static float getScore(int8_t rssi) {
	if (0) { // DFT transformation
	    float sum1 = 0;
	    float sum2 = 0;
		int16_t j = indexArray - 1;
		float pi = 3.14159;
		for (uint16_t i = 0; i < countArray; i++) {
			if (j < 0) {
				j = countArray - 1;
			}
			sum1 = sum1 + array[j] * cos(2 * pi * 3 * i / totalArray);
			sum2 = sum2 + array[j] * sin(2 * pi * 3 * i / totalArray);
			j--;
		}
	    return sum1 * sum1 + sum2 * sum2;
	}
	if (1) { // Correlation based
		int sum[4] = {0, 0, 0, 0};
		int16_t j = indexArray - 1;
		for (uint16_t i = 0; i < 40; i++) {
			if (j < 0) {
				j = countArray - 1;
			}
			sum[i/10] = sum[i/10] + array[j];
			j--;
		}
		int m1 = sum[0]; m1 = m1 > sum[2]? sum[2]: m1;
		int m2 = sum[1]; m2 = m2 < sum[3]? sum[3]: m2;
	    float score1 = (m1 - m2)*2.0*(m1-m2)*(m1-m2)/100;
		m1 = sum[0]; m1 = m1 > sum[3]? sum[3]: m1;
		m2 = sum[1]; m2 = m2 < sum[2]? sum[2]: m2;
		float score2 = (m1 - m2)*2.0*(m1-m2)*(m1-m2)/100;
		float score = score1;
		score = score < score2? score2:score;
		return score;
	}
	return 0;
}


/**
 * @brief Function for shutdown events.
 *
 * @param[in]   event       Shutdown type.
 */
static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Shutdown handler");

