sahoo00/nRF52/TRG2_receiver/Application/client.c
    while (index < p_adv_report->dlen)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index + 1];
        if (   (field_type == BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_MORE_AVAILABLE)
                 || (field_type == BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_COMPLETE))
        {
        	bool match = true;
        	//NRF_LOG_HEXDUMP_INFO(&p_data[index + 2], 16);
        	//NRF_LOG_HEXDUMP_INFO(&p_target_uuid->uuid128, 16);
            for (uint8_t i = 0; i < 16; i++) {
            	if (p_data[index + 2 + i] != p_target_uuid->uuid128[i]) {
            		match = false;
            	}
            }
            if (match) {
                return true;
            }
        }
        index += field_length + 1;
    }
    return false;
}

static bool is_uuid128_present_any(ble_gap_evt_adv_report_t const * p_adv_report) {
	return is_uuid128_present(&m_smph_uuid, p_adv_report) ||
			is_uuid128_present(&m_mn_uuid, p_adv_report);
}


void trg2c_event_trigger() {
	NRF_LOG_INFO("trg2c_event_trigger : %d", trg2c_trigger);
	if (trg2c_trigger == 0) {
		trg2c_event_start = trg2c_index;
		schedule_test();
	}
	else {
		vibrate();
	}
	if (trg2c_index == trg2c_event_start || trg2c_index > (trg2c_event_start + 20)) {
		trg2c_trigger++;
	}
}

void trg2c_event_reset() {
	trg2c_trigger = 0;
}

void schedule_test() {
	NRF_LOG_INFO("schedule test");
	ret_code_t            err_code;
	err_code = app_timer_start(m_trg_timer_id, APP_TIMER_TICKS(10000), NULL);
	APP_ERROR_CHECK(err_code);
	vibrate();
}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
void on_ble_central_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t            err_code;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
	float score = 0;
	uint16_t sum = 0;
	static uint16_t last_evt = 0;
	if (last_evt != p_ble_evt->header.evt_id) {
		NRF_LOG_INFO("on_ble_central_evt 0x%x", p_ble_evt->header.evt_id);
	}
    last_evt = p_ble_evt->header.evt_id;
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
        {
            ble_gap_evt_adv_report_t const * p_adv_report = &p_gap_evt->params.adv_report;

            if (get_trg2_state() == TRG2_SIGNAL && is_uuid_present(&m_nus_uuid, p_adv_report)) {
            	sum = getValue(p_adv_report->rssi);
            	score = getScore(p_adv_report->rssi);
            	trg2_signal_data_t sd = {trg2c_trigger, trg2c_index, sum, p_adv_report->rssi, score};
            	//NRF_LOG_INFO("%ld %d %d %f\r\n", sd.trg2c_index, sd.sum, sd.rssi, sd.score);
            	//if ((indexArray & 0x1) == 0) {
            		send_signal_data(&sd);
            	//}
            	trg2c_index++;
            	if (score > 700) {
            		trg2c_event_trigger();
            	}
            }
            if ( (get_trg2_state() == TRG2_TRIGGER ||  get_trg2_state() == TRG2_GPS ||
            		get_trg2_state() == TRG2_ROUTER) &&
            		is_uuid128_present_any(p_adv_report) ) {

                err_code = sd_ble_gap_connect(&p_adv_report->peer_addr,
                                              &m_scan_params,
                                              &m_connection_param,
                                              APP_BLE_CONN_CFG_TAG);
                NRF_LOG_INFO("Found %ld\r\n", err_code);
				if (err_code == NRF_SUCCESS) {
					// scan is automatically stopped by the connect
					NRF_LOG_INFO("Connecting to target %02x%02x%02x%02x%02x%02x",
							p_adv_report->peer_addr.addr[0],
							p_adv_report->peer_addr.addr[1],
							p_adv_report->peer_addr.addr[2],
							p_adv_report->peer_addr.addr[3],
							p_adv_report->peer_addr.addr[4],
							p_adv_report->peer_addr.addr[5]);
					if (is_uuid128_present(&m_smph_uuid, p_adv_report)) {
						memcpy(m_smph_addr, p_adv_report->peer_addr.addr, BLE_GAP_ADDR_LEN);
					}
					if (is_uuid128_present(&m_mn_uuid, p_adv_report)) {
						memcpy(m_mn_addr, p_adv_report->peer_addr.addr, BLE_GAP_ADDR_LEN);
					}
				}
            }
        }
        break; // BLE_GAP_EVT_ADV_REPORT

        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected to target");
            //nrf_delay_ms(600);
            /*err_code = ble_nus_c_handles_assign(&m_ble_smph_c, p_ble_evt->evt.gap_evt.conn_handle, NULL);
            APP_ERROR_CHECK(err_code); */

            // Discover peer's services.
            memset(&m_db_disc, 0x00, sizeof(m_db_disc));
            // start discovery of services. The NUS Client waits for a discovery result
            err_code = ble_db_discovery_start(&m_db_disc, p_ble_evt->evt.gap_evt.conn_handle);
            NRF_LOG_INFO("Starting discovery: %d", err_code);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_GAP_EVT_DISCONNECTED:
        	NRF_LOG_INFO("Disconnected from target");
        	memset(&m_db_disc, 0x00, sizeof(m_db_disc));
        	scan_start();
        	break;
        case BLE_GAP_EVT_TIMEOUT:
            if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN)
            {
                NRF_LOG_INFO("Scan timed out.");
                scan_start();
            }
            else if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
            {
                NRF_LOG_INFO("Connection Request timed out.");
            }
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
            // Accepting parameters requested by peer.
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                                    &p_gap_evt->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(err_code);
            break;

#ifndef S140
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;
#endif

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            break;
    }

