sahoo00/nRF52/TRG2_receiver/Application/client.c
}


uint8_t isSMPHConnected() {
	return m_ble_smph_c.conn_handle != BLE_CONN_HANDLE_INVALID;
}
uint8_t isMNConnected() {
	return m_ble_mn_c.conn_handle != BLE_CONN_HANDLE_INVALID;
}
uint8_t isConnected() {
	return isSMPHConnected() || isMNConnected();
}

void trg2c_disconnect_smph() {
    uint32_t      err_code;
    if (isSMPHConnected()) {
    	err_code = sd_ble_gap_disconnect(m_ble_smph_c.conn_handle,
    	                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    	NRF_LOG_INFO("SMPH disconnect: %d", err_code);
    	APP_ERROR_CHECK(err_code);
    }
}
void trg2c_disconnect_mn() {
    uint32_t      err_code;
    if (isMNConnected()) {
        err_code = sd_ble_gap_disconnect(m_ble_mn_c.conn_handle,
        	                                BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        NRF_LOG_INFO("MN disconnect: %d", err_code);
        APP_ERROR_CHECK(err_code);
    }
}
void trg2c_disconnect() {
	trg2c_disconnect_smph();
	trg2c_disconnect_mn();
}

void reset_client() {
	disable_gps();
	set_trg2_state(TRG2_SIGNAL);
	trg2c_event_reset();
	trg2c_disconnect();
	scan_start();
}

void send_trigger_smph(void) {
	if (!isSMPHConnected()) {
		return;
	}
	NRF_LOG_INFO("Sending trigger SMPH\r\n");
    uint32_t ret_val;
	do {
		ret_val = ble_nus_c_string_send(&m_ble_smph_c, (uint8_t *)&device_id, sizeof(device_id));
		if ((ret_val != NRF_ERROR_INVALID_STATE)
				&& (ret_val != NRF_ERROR_BUSY)) {
			APP_ERROR_CHECK(ret_val);
		}
	} while (ret_val == NRF_ERROR_BUSY);
}
void send_trigger_mn(void) {
	if (!isMNConnected()) {
		return;
	}
	NRF_LOG_INFO("Sending trigger MN\r\n");
    uint32_t ret_val;
	do {
		ret_val = ble_nus_c_string_send(&m_ble_mn_c, (uint8_t *)&device_id, sizeof(device_id));
		if ((ret_val != NRF_ERROR_INVALID_STATE)
				&& (ret_val != NRF_ERROR_BUSY)) {
			APP_ERROR_CHECK(ret_val);
		}
	} while (ret_val == NRF_ERROR_BUSY);
}


void send_trigger(void) {

	NRF_LOG_INFO("Sending trigger %d %d\r\n", ready_to_send, get_trg2_state());
	NRF_LOG_FLUSH();
	if (!ready_to_send) return;
	if (get_trg2_state() != TRG2_TRIGGER) {
		// reset
		reset_client();
	}
	send_trigger_smph();
	send_trigger_mn();
	trg2c_event_reset();
	nrf_delay_ms(100);
	if (ready_to_send > 0) {
		ready_to_send--;
	}
	if (ready_to_send > 0) {
		schedule_test();
	}
	else {
		set_trg2_state(TRG2_GPS);
		ready_to_send = 2;
		enable_gps();
	}
}

void send_gps_data_smph() {
	if (!isSMPHConnected()) {
		return;
	}
	NRF_LOG_INFO("Sending GPS data SMPH\r\n");
    uint32_t ret_val;
	do {
		/*
		struct nmea_gga_data * p_gga_data = get_gga_data();
		trg2_gps_data_t gps_data = { {0x02, TRG2_DEVICE_ID}, p_gga_data[0] };
		*/
		sh_gps_packet_t loc = get_sh_gps_packet();
		ret_val = ble_nus_c_string_send(&m_ble_smph_c, (uint8_t *)&loc, sizeof(loc));
		if ((ret_val != NRF_ERROR_INVALID_STATE)
				&& (ret_val != NRF_ERROR_BUSY)) {
			APP_ERROR_CHECK(ret_val);
		}
	} while (ret_val == NRF_ERROR_BUSY);
}
void send_gps_data_mn() {
	if (!isMNConnected()) {
		return;
	}
	NRF_LOG_INFO("Sending GPS data MN\r\n");
    uint32_t ret_val;
	do {
		/*
		struct nmea_gga_data * p_gga_data = get_gga_data();
		trg2_gps_data_t gps_data = { {0x02, TRG2_DEVICE_ID}, p_gga_data[0] };
		*/
		sh_gps_packet_t loc = get_sh_gps_packet();
		ret_val = ble_nus_c_string_send(&m_ble_mn_c, (uint8_t *)&loc, sizeof(loc));
		if ((ret_val != NRF_ERROR_INVALID_STATE)
				&& (ret_val != NRF_ERROR_BUSY)) {
			APP_ERROR_CHECK(ret_val);
		}
	} while (ret_val == NRF_ERROR_BUSY);
}

void send_gps_data(void) {
	if (!isConnected()) {
		scan_start();
		return;
	}
	if (!ready_to_send) return;
	if (get_trg2_state() != TRG2_GPS) {
		// reset
		reset_client();
	}

	send_gps_data_smph();
	send_gps_data_mn();

	trg2c_event_reset();
	nrf_delay_ms(100);
	if (ready_to_send > 0) {
		ready_to_send--;
	}
	if (ready_to_send <= 0) {
		reset_client();
	}
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in] event  Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    NRF_LOG_INFO("bsp_event_handler: 0x%x", event);
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_ble_smph_c.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            break;
    }
}

void test_trg2_handler(void * p_context) {
	NRF_LOG_INFO("Test trg2 handler: %d %d %d", get_trg2_state(), trg2c_trigger, ready_to_send);
	if (get_trg2_state() == TRG2_SIGNAL && trg2c_trigger > 1) {
		set_trg2_state(TRG2_TRIGGER);
		send_trigger();
	}
	if (get_trg2_state() == TRG2_TRIGGER) {
		send_trigger();
	}
	trg2c_event_reset();
}

uint32_t ble_trg2_init(ble_nus_c_t * p_ble_nus_c, ble_nus_c_init_t * p_ble_nus_c_init,
		const ble_uuid128_t * uuid_base, const uint16_t uuid)
{
    uint32_t      err_code;
    ble_uuid_t    uart_uuid;

    VERIFY_PARAM_NOT_NULL(p_ble_nus_c);
    VERIFY_PARAM_NOT_NULL(p_ble_nus_c_init);

    err_code = sd_ble_uuid_vs_add(uuid_base, &p_ble_nus_c->uuid_type);
    VERIFY_SUCCESS(err_code);

    uart_uuid.type = p_ble_nus_c->uuid_type;
    uart_uuid.uuid = uuid;

    p_ble_nus_c->conn_handle           = BLE_CONN_HANDLE_INVALID;
    p_ble_nus_c->evt_handler           = p_ble_nus_c_init->evt_handler;
    p_ble_nus_c->handles.nus_tx_handle = BLE_GATT_HANDLE_INVALID;
    p_ble_nus_c->handles.nus_rx_handle = BLE_GATT_HANDLE_INVALID;

    return ble_db_discovery_evt_register(&uart_uuid);
}

/**@brief Function for initializing the NUS Client. */
void trg2_client_init(void)
{
    ret_code_t       err_code;
    ble_nus_c_init_t init_smph;
    ble_nus_c_init_t init_mn;

    init_smph.evt_handler = ble_smph_c_evt_handler;
    init_mn.evt_handler = ble_mn_c_evt_handler;

