sahoo00/nRF52/TRG2_receiver/Application/client.c
    err_code = ble_trg2_init(&m_ble_smph_c, &init_smph, &m_smph_uuid, SMPH_UUID_SERVICE);
    APP_ERROR_CHECK(err_code);
    err_code = ble_trg2_init(&m_ble_mn_c, &init_mn, &m_mn_uuid, MN_UUID_SERVICE);
    APP_ERROR_CHECK(err_code);

	/* Define a timer id used for 10Hz sample rate */
	err_code = app_timer_create(&m_trg_timer_id, APP_TIMER_MODE_SINGLE_SHOT, test_trg2_handler);
	APP_ERROR_CHECK(err_code);

}


/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{

    switch (pin_no)
    {
        case BUTTON_TRG2_S_PIN:
        	NRF_LOG_INFO("Send button state change %d", button_action);
        	if (button_action == 1) {
        		button_state = button_state ? 0:1;
        		if (button_state == 1) {
        			NRF_LOG_INFO("stop: %d", button_state);
        			leds_reset();
        		}
        		else {
        			NRF_LOG_INFO("start: %d", button_state);
        			//set_trg2_state(TRG2_SIGNAL);
        			//trg2c_event_reset();
        			//trg2c_disconnect();
        			//scan_start();
        			sd_nvic_SystemReset();
        		}
        	}
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}

void led_handler(void * p_context) {
	router(NULL);
	if (button_state == 0) {
		nrf_gpio_pin_toggle(LED_TRG2_S_PIN);
	}
}

/**@brief Function for initializing LEDs. */
void leds_reset(void)
{
	nrf_gpio_pin_write(LED_TRG2_S_PIN, 1);
}

/**@brief Function for initializing buttons and leds. */
void buttons_leds_init(void)
{
    APP_GPIOTE_INIT(1);
    /* Configure LED pin */
	nrf_gpio_cfg_output(LED_TRG2_S_PIN);
	leds_reset();

	ret_code_t err_code;

	/* Define a timer id used for 10Hz sample rate */
	err_code = app_timer_create(&m_led_timer_id, APP_TIMER_MODE_REPEATED, led_handler);
	APP_ERROR_CHECK(err_code);
	err_code = app_timer_start(m_led_timer_id, APP_TIMER_TICKS(5000), NULL);
	APP_ERROR_CHECK(err_code);

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {BUTTON_TRG2_S_PIN, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)
    {
        NRF_LOG_INFO("ATT MTU exchange completed.");

        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("Ble NUS max data length set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
void db_client_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    ble_trg2_on_db_disc_evt(&m_ble_smph_c, p_evt, SMPH_UUID_SERVICE);
    ble_trg2_on_db_disc_evt(&m_ble_mn_c, p_evt, MN_UUID_SERVICE);
}

void vibrate(void) {
	nrf_gpio_cfg_output(VIB_MOT_TRG2_S_PIN);
	nrf_gpio_pin_write(VIB_MOT_TRG2_S_PIN, 1);
	nrf_delay_ms(60);
	nrf_gpio_pin_write(VIB_MOT_TRG2_S_PIN, 0);
}

